# 06 - Combining datasets

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [15]:
import pandas as pd
import numpy as np
import random

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [16]:
first = [random.randint(1,4) for _ in range(100)]
second = [random.randint(1,3) for _ in range(100)]
third = [random.randint(10.000,30.000) for _ in range(100)]

In [17]:
first = pd.DataFrame(first)
second = pd.DataFrame(second)
third = pd.DataFrame(third)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [18]:
all_series_col = pd.concat([first, second, third], axis=1)
all_series_col

    0  0   0
0   2  2  23
1   1  3  16
2   3  3  27
3   2  1  24
4   3  3  22
.. .. ..  ..
95  4  1  14
96  4  2  19
97  2  1  29
98  4  3  20
99  2  3  18

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [19]:
all_series_col.set_axis(['bedrs', 'bathrs', 'price_sqr_meter'], 
                    axis='columns', inplace=True)

all_series_col

    bedrs  bathrs  price_sqr_meter
0       2       2               23
1       1       3               16
2       3       3               27
3       2       1               24
4       3       3               22
..    ...     ...              ...
95      4       1               14
96      4       2               19
97      2       1               29
98      4       3               20
99      2       3               18

[100 rows x 3 columns]

### Step 5. Create a column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [21]:
bigcolumn = pd.concat([first, second, third])
bigcolumn.set_axis(['bigcolumn'],axis='columns', inplace=True)
bigcolumn

    bigcolumn
0           2
1           1
2           3
3           2
4           3
..        ...
95         14
96         19
97         29
98         20
99         18

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [ ]:
# Sí, así es

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [22]:
bigcolumn = bigcolumn.reset_index(drop = True)
bigcolumn

     bigcolumn
0            2
1            1
2            3
3            2
4            3
..         ...
295         14
296         19
297         29
298         20
299         18

[300 rows x 1 columns]